artillery/support-questions/queries/care_reception.yml
config:
  target: 'https://lemonade.leersteun.lars-tst.school'
  processor: "../../utils/response-logger.js"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Simple load test"
  plugins:
    apdex:
      threshold: 500    
  variables:
    access_token: "{{ $env.ACCESS_TOKEN }}"
    mongo_claims: "{{ $env.MONGO_CLAIMS }}"

scenarios:
  - name: "Support Question View Query"
    weight: 100
    flow:
      - parallel:
        # Support Questions list
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: "4126aba9-622d-4ada-98c3-2eb319793ec6"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              # - $match:
              #     supportQuestion.status: "OPEN"
              #       # $in:
              #       #   - "OPEN"
              #       #   - "INCOMPLETE"
              - $sort:
                  creationDate: -1
              - $facet:
                  data:
                    - $skip: 0
                    - $limit: 50
                  pagination:
                    - $count: "count"
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Teams list
        - post:
            url: "/api/zorglink/zorglink-team"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: "4126aba9-622d-4ada-98c3-2eb319793ec6"
              - $sort:
                  name: 1
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200